---
kind: method
id: M:Autodesk.Revit.DB.Architecture.Stairs.GetStairsRuns
zh: 楼梯
source: html/a8812cc1-6ba7-7908-bea6-92e5bcb19627.htm
---
# Autodesk.Revit.DB.Architecture.Stairs.GetStairsRuns Method

**中文**: 楼梯

Returns all the stairs run components in the stairs.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetStairsRuns()
```

## Returns
The stairs run components in the stairs.